### Exploring Northwind database using SQL

The Northwind database was originally created by Microsoft. It simulates a wholesale business called "Northwind Traders" that imports and exports foods worldwide.

In this exercise, I explore the Northwind database using Postgre SQL.

In [ ]:
#Import libraries
import pandas as pd
from sqlalchemy import create_engine

In [ ]:
# Create database connection
engine = create_engine('postgresql+psycopg2://tharinduabeysinghe:####@localhost/northwind')

# Run quey and load data to a dataframe
def execute_sql_query(sql):
    # Load data into a pandas DataFrame
    df = pd.read_sql_query(sql, con=engine)
    return df

In [ ]:
# Define your SQL query
sql = "SELECT * FROM categories;"

# Execute query
execute_sql_query(sql)

,category_id,category_name,description,picture
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",[]
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an...",[]
2,3,Confections,"Desserts, candies, and sweet breads",[]
3,4,Dairy Products,Cheeses,[]
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal",[]
5,6,Meat/Poultry,Prepared meats,[]
6,7,Produce,Dried fruit and bean curd,[]
7,8,Seafood,Seaweed and fish,[]

### Common Table Expressions (CTEs)
A CTE is a named temporary result set. CTEs are defined using WITH keyword and used as a subquery. A CTE can be referenced within a single query (SELECT, INSERT, UPDATE, or DELETE) statement. A CTE is created only in the memory, not as a table in the database. Once the query is cancelled, the CTE is not available anymore.

The query below pulls yearly order data from the database and then aggregates total sales per year in the outer query.

In [8]:
sql = '''WITH yearlysales
              AS (SELECT Date_part('year', o.order_date) AS orderyear,
                    od.unit_price,
                    od.quantity
                FROM orders o
                LEFT JOIN order_details od
                       ON od.order_id = o.order_id)
         SELECT orderyear,
             Sum(unit_price * quantity) AS TotalSales
         FROM   yearlysales
         GROUP  BY orderyear
         ORDER  BY orderyear; '''

# Execute query
execute_sql_query(sql)

   orderyear     totalsales
0     1996.0  226298.501350
1     1997.0  658388.749487
2     1998.0  469771.339604